Revit 2027 API
FamilySizeTableColumn Methods
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSpecTypeId |  Gets the identifier of the spec describing values in the column.
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetUnitTypeId |  Gets the identifier of the unit quantifying values in the column.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace